# На вход программе подаётся одно число n. Напишите программу, которая выводит список [1, 2, 3, ..., n].

n = int(input())

numbers=list(range(1, n+1))  

print(numbers)