# Напишите программу, которая принимает целое число X и определяет, принадлежит ли данное число указанным промежуткам

x = int(input())
if x > -3 and x < 7:
    print("Не принадлежит")
else:
    print("Принадлежит")
