# Напишите программу, которая принимает целое число X и определяет, принадлежит ли данное число указанному промежутку.

x = int(input())
if x > -1 and x < 17:
    print("Принадлежит")
else:
    print("Не принадлежит")
