# На вход программе подаётся строка текста. Напишите программу, которая заменяет все вхождения цифры 1 на слово «one».

s = input()
s = s.replace('1', 'one')
print(s)