# На вход программе подаётся строка текста. Напишите программу, которая удаляет все вхождения символа «@».

s = input()
s = s.replace('@', '')
print(s)