# Дано положительное действительное число. Выведите его дробную часть.

a = float(input())

b = int(a)

c = a - b

print(c)
