# Даны пять чисел a1, a2, a3, a4 и a5. Напишите программу, которая вычисляет сумму их модулей |a1| + |a2| + |a3| + |a4| + |a5|

a = float(input())
b = float(input())
c = float(input())
d = float(input())
e = float(input())

sum = abs(a) + abs(b) + abs(c) + abs(d) + abs(e) 

print(sum)