# На вход программе подаётся строка.
# Напишите программу, которая меняет регистр символов – заменяет все строчные символы заглавными и наоборот.

s = input()

s = s.swapcase()

print(s)
