# Напишите программу, которая определяет, является число четным или нечетным

int = int(input())

if int%2 == 0:
    print('Четное')
else:
    print('Нечетное')