# Напишите программу, которая определяет наименьшее из двух чисел.

int_1 = int(input())
int_2 = int(input())

if int_1 < int_2:
    print(int_1)
else:
    print(int_2)