# Напишите программу, которая находит полное число метров по заданному числу сантиметров.

sm = int(input())
meters = sm // 100
print(meters)