#Напишите программу, которая выводит прямоугольник, по периметру состоящий из звёздочек (*).

print('*****************')
print('*               *')
print('*               *')
print('*****************')